Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/PTZ/SetPreset/TC.PTZ.NVT.16_REQ_03.xml

<?xml version='1.0' encoding='utf-8'?>
<s:Envelope
 xmlns:s="http://www.w3.org/2003/05/soap-envelope"
 xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Body>
    <tptz:SetPreset>
      <tptz:ProfileToken></tptz:ProfileToken>
      <tptz:PresetName>PresetName1</tptz:PresetName>
      <tptz:PresetToken>PresetToken1</tptz:PresetToken>
    </tptz:SetPreset>
  </s:Body>
</s:Envelope>